

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  

# Стартовый диалог
HELLO_MESS = "Вы находитесь в меню поиска участников."
HELLO_MESS_2 = "Нажмите кнопку поиска, введите на выбор: "\
    "имя и фамилию/имя пользователя телеграм/ тег или ключевое "\
        "слово/сегмент бизнеса и URBANIUS BOT выдаст вам профиль пользователя."

FIND_FINISH = "Завершена работа с пользователем"
FIN_RATING = "Оценка установлена"
NO_SELF_RATING = "Нельзя ставить оценку самому себе"

OFFER_HELLO = "Напишите пару слов о сути сделки. "\
    "Кто исполнитель, кто заказчик, сроки и дополнительные детали сделки."
FIN_OFFER = "Сделка отправлена"

ACCEPTED_OFFER = "Ваше предложение интересно участнику сообщества URBANIUS CLUB @{} {} {}. "\
    "Просим вам перейти к прямой коммуникации."


REJECTED_OFFER = "К сожалению, в настоящий момент участник сообщества URBANIUS CLUB @{} {} {} отклонил ваше предложение."