

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  

# Стартовый диалог
HELLO_MESS = "Вы находитесь в меню отправки сообщений."

CONV_FINISH = "Завершена работа с сообщениями"

ASK_MESS = "Введите текст сообщения"

NO_ADMIN_GROUP = 'Группа "Администраторы" не найдена или не указан ее чат. Сообщите об ошибке'

MESS_SENDED = "Сообщение отослано"
SENDING_CANCELED = "Отправка сообщения отменена"

SENDING_ANON_MESS = "Отправка анонимного сообщения"
ASK_ANON_MESS_GROUP = "Выберите группу куда отослать сообщение"

