MAX_VIDEOS_COUNT = 1
MAX_IMAGES_COUNT = 4
MAX_ADVERTISEMENTS_COUNT = 3
MAX_VIDEO_DURATION = 90 # sec

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  
GROUP_FINISH = "Работа с группами завершена"
# Стартовый диалог
HELLO_MESS_2 = "Нажмите кнопку поиска и введите фразу, по которой будем искать."

ASK_SELECT_GROUP = "Список доступных Вам групп. Выберите группу"

HELLO_TEXT = "Каждый пост проходит модерацию сообщества. Введите Ваше рекламное сообщение. "\
    f"Вы можете прикрепить ссылки, фото не более {MAX_IMAGES_COUNT}-х, "\
        f"видео не более {MAX_VIDEO_DURATION} сек. но это должно быть только 1 сообщение! "\
        "Текст сообщения должен быть длиной до 900 символов (примерно 1 экран мобильного телефона)."

ADD_ADVERTISEMENT_FILE = "Прикрепите файл изображения или видео."

ADMERTISEMENT_CREATED = "Рекламное сообщение отправлено на адмиссию."

NO_ADMIN_GROUP = 'Группа "Администраторы" не найдена или не указан ее чат. Сообщите об ошибке'

NO_FOR_ALL_USERS_GROUPS = "Отсутствуют группы с пометками 'Для всех пользователей'."

NO_SEND_ADVERTISEMENT_GROUPS = "Отсутствуют группы с пометками 'Отправлять рекламные сообщения'."