

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  
GROUP_FINISH = "Работа с группами завершена"
# Стартовый диалог
HELLO_MESS_2 = "Нажмите кнопку поиска и введите фразу, по которой будем искать."

ASK_SELECT_GROUP = "Список доступных Вам групп. Выберите группу"

ECHO = "Каждый пост проходит модерацию сообщества. Введите Ваше рекламное сообщение. "\
    "Вы можете прикрепить ссылки, фото/видео, но это должно быть только 1 сообщение! "\
    "Текст сообщения должен быть длиной до 900 символов (примерно 1 экран мобильного телефона)."
