
from tgbot.models import User

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  
PROF_FINISH = "Работа с профилем завершена"
# Стартовый диалог
PROF_HELLO = "Вы находитесь в меню вашего профиля. " \
             "Здесь вы можете посмотреть и изменить свои данные." 

ASK_FIO = "Ваше ФИО '{}'. Можете ввести другие или пропустить этот шаг"

ASK_PHONE = "Ваш телефон '{}'. Можете ввести другой или пропустить этот шаг"         

ASK_ABOUT = "Ваш текст 'О себе': '{}'. Можете ввести другой или пропустить этот шаг" 

ASK_BIRHDAY = "Ваша дата рождения '{}'. Можете ввести другую или пропустить этот шаг" 

BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг" 

ASK_EMAIL = "Ваш e-mail '{}'. Можете ввести другой или пропустить этот шаг" 
           
BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_CITI = "Ваш город '{}'. Можете ввести другой или пропустить этот шаг"

ASK_COMPANY = "Ваша компания '{}'. Можете ввести другую или пропустить этот шаг"

ASK_JOB = "Ваша должность '{}'. Можете ввести другую или пропустить этот шаг"

ASK_SITE = "Ваш сайт '{}'. Можете ввести другой или пропустить этот шаг"
