
from tgbot.models import User

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  
PROF_FINISH = "Работа с профилем завершена"
# Стартовый диалог
PROF_HELLO = "Вы находитесь в меню вашего профиля. " \
             "Здесь вы можете посмотреть и изменить свои данные." 

PERSONAL_START_MESSS = "Вы находитесь в меню изменения персональной информации"
BUSINES_START_MESSS = "Вы находитесь в меню изменения бизнес информации"
ABOUT_START_MESSS = "Вы находитесь в меню изменения информации о себе"

ASK_FIO = "Ваше ФИО '{}'. Можете ввести другие или пропустить этот шаг"

ASK_PHONE = "Ваш телефон '{}'. Можете ввести другой или пропустить этот шаг"         

ASK_ABOUT = "Ваш текст 'О себе': '{}'. Можете ввести другой или пропустить этот шаг" 

ASK_BIRHDAY = "Ваша дата рождения '{}'. Можете ввести другую или пропустить этот шаг" 

BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг" 

ASK_EMAIL = "Ваш e-mail '{}'. Можете ввести другой или пропустить этот шаг" 
           
BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_CITI = "Ваш город '{}'. Можете ввести другой или пропустить этот шаг"

ASK_COMPANY = "Ваша компания '{}'. Можете ввести другую или пропустить этот шаг"

ASK_JOB = "Ваша должность '{}'. Можете ввести другую или пропустить этот шаг"

ASK_SITE = "Ваш сайт '{}'. Можете ввести другой или пропустить этот шаг"

ASK_INN = "Ваш INN '{}'. Можете ввести другой или пропустить этот шаг"

ASK_TAGS = "Ваши теги '{}'. Можете ввести другие или пропустить этот шаг"

ASK_FOTO = "Ваше фото. Можете прислать другое или пропустить этот шаг"
NOT_FOTO = "Файл с фото утерян. Можете прислать другое или пропустить этот шаг"

ASK_REGION = "Ваш регион '{}'. Можете ввести другой или пропустить этот шаг"

ASK_BRANCH = "Ваша отрасль '{}'. Можете ввести другую или пропустить этот шаг"

SAY_STATUS = "Ваша статус '{}'. Вы не можете сами его изменять"

SAY_GROUPS = "Ваши группы: \n{}\nВы не можете сами их изменять"

ASK_NEEDS = "Ваши потребности: \n{}\nВы можете их изменять"

ASK_SPORT = "Ваши виды спорта: \n{}\nВы можете их изменять"

ASK_HOBBY = "Ваши виды хобби: \n{}\nВы можете их изменять"

ASK_OFFERS = "Ваши предложения:"
NO_OFFERS = "У Вас пока нет предложений"
ADD_OFFERS = "Для добавления предложения пришлите сообщение с прикрепленным медиафайлом"

ASK_SOC_NET = "Ваши cоциальные сети: \n{}\nВы можете их изменять"

ASK_REFERES = "Ваши рекомендатели: \n{}\nВы можете их изменять"