REGISTRATION_CANCELED = "Процедура регистраци отменена." 

ASK_REENTER = "Пожалуйста, просто нажми кнопку «Отправить номер», "\
    "ничего не вводя в поле. Номер отправится автоматически. "\
        "Если кнопка не видна, откройте меню, как указано на картинке выше."  

USERNAME_NEEDED = "<b>Рекомендуется создать имя пользователя в настройках своего профиля Telegram.</b>"

REGISTRATION_START_MESSS = "Здравствуйте! Вы еще не зарегистрированы в системе URBANIUS CLUB. Пройдите регистрацию."                  
                           
WELCOME_REG = "Вас приветствует Urbanius Bot - "\
    "интерактивный помощник сообщества."
# WELCOME_REG = "Вас приветствует Urbanius Bot - "\
#     "интерактивный помощник сообщества. Нажимая кнопку «Согласен», " \
#     "Вы даете свое согласие на обработку ваших персональных данных. " \
#     "Полная версия Политики конфиденциальности расположена в сети Интернет " \
#         "по адресу https://urbanius.club/policy."
# WELCOME_REG = "Добрый день! Вы находитесь в Telegram боте URBANIUS CLUB. " \
#           "Для участия Вам необходимо пройти регистрацию. Ознакомьтесь, пожалуйста, с Политикой конфиденциальности. " \
#           "Нажимая кнопку «Согласен», Вы даете свое согласие на обработку ваших персональных данных. " \
#           "Это необходимо, чтобы мы могли с вами взаимодействовать. \n" \
#           "Политика конфиденциальности: https://urbanius.club/policy"
ASK_APPROVAL = "Нажимая кнопку «Согласен», " \
    "Вы даете свое согласие на обработку ваших персональных данных. " \
    "Полная версия Политики конфиденциальности расположена в сети Интернет " \
        "по адресу https://urbanius.club/policy."

ASK_PHONE = "Предоставьте свой номер телефон для связи по кнопке ниже."

ASK_FIO = "Ваше ФИО взяты из Телеграм '{}'. Можете ввести другие или пропустить этот шаг."

ASK_FIRSTNAME = "1. Имя"

ASK_LASTNAME = "3. Фамилия"

ASK_SURNAME = "2. Отчество"

ASK_ABOUT = "Напишите подробно о своей деятельности: в каких компаниях работаете/работали или основали? " \
            "Над какими проектами сейчас работаете? Ваши достижения."

ASK_BIRHDAY = "Сообщите Ваш день рождения в формате дд.мм.гггг."

BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг"

ASK_EMAIL = "Укажите ваш E-mail в формате <b>example@domain.ru</b>. " \
            "E-mail необходим для рассылки новостей, важных изменений, наград за участие и т.д."
           
BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_CITI = "4. Город"

ASK_COMPANY = "5. Наименование компании. Если у вас несколько компаний, введите через запятую."

ASK_JOB = "6. Занимаемая должность"

ASK_JOB_REGION = "8. Регионы присутствия вашего бизнеса"

ASK_SITE = "7. Адрес сайта"

BAD_SITE = "Укажите пожалуйста сайт именно ссылкой"

FINISH = "Закончена работа с новым пользователем"

ASK_RESIDENT_URBANIUS_CLUB = "15. Являетесь ли вы Резидентом URBANIUS CLUB?"

ASK_BUSINESS_CLUB_MEMBER = "16. Являетесь ли вы членом бизнес-клуба, " \
    "профильной общественной организации или ассоциации? Если да, укажите пожалуйста какой."

ASK_DEEP_LINK = "17. Кто поделился с вами реферальной ссылкой? Для поиска нажмите \"Найти пользователя\""

ASK_DEEP_LINK_NO_USER = "Пользователь с таким юзернеймом не найден. " \
    "Укажите пожалуйста корректный юзернейм телеграм"

ASK_COMPANY_TURNOVER = "9. Оборот компании / год"

ASK_COMPANY_NUMBER_OF_EMPLOYESS = "10. Численность сотрудников вашего бизнеса"

MAX_BUSINESS_NEEDS = MAX_BUSINESS_BENEFITS = 3

ASK_COMPANY_BUSINESS_NEEDS = "12. Регулярные потребности вашего бизнеса (при необходимости введите свой вариант)"

ASK_CREATE_COMPANY_BUSINESS_NEEDS = "Введите свой вариант потребности вашего бизнеса"

ASK_COMPANY_COMPANY_BUSINESS_BENEFITS = "14. Чем вы можете быть полезны участникам сообщества? (при необходимости введите свой вариант)"

ASK_CREATE_COMPANY_BUSINESS_BENEFITS = "Введите свой вариант чем можете быть полезны участникам сообщества"

MAX_BUSINESS_BRANCHES = 5

ASK_COMPANY_COMPANY_BUSINESS_BRANCHES = "11. Сегмент вашего бизнеса"

CHECK_ICON = "☑️ "

ASK_PHOTO = "Загрузите свою фотографию."

NO_FOR_ALL_USERS_GROUPS = "Отсутствуют группы с пометками 'Для всех пользователей'."

ASK_TAGS = "13. Теги, ключевые слова для дальнейшего поиска вашего профиля, введите через запятую."
