REGISTRATION_CANCELED = "Процедура регистраци отменена." 

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  

USERNAME_NEEDED = "<b>Рекомендуется создать имя пользователя в настройках своего профиля Telegram.</b>"
                  
WELCOME = "Добрый день! Вы находитесь в Telegram боте URBANIUS CLUB" \
          "Для участия вам необходимо пройти регистрацию. Ознакомьтесь, пожалуйста, с Политикой конфиденциальности. " \
          "Нажимая кнопку <b>«Согласен»</b> вы даете свое согласие на обработку ваших персональных данных. " \
          "Это необходимо, чтобы мы могли с вами взаимодействовать. \n" \
          "Политика конфиденциальности: https://urbanius.club/" 

ASK_PHONE = "Предоставьте свой номер телефона, чтобы мы могли при необходимости с вами связаться. " \
            "Это может потребоваться в случае возникновения вопросов, отправки наград или прочим вопросам."         

ASK_FIO = "Ваше ФИО взятые из Телеграм '{}'. Можете ввести другие или пропустить этот шаг"

ASK_BIRHDAY = "Сообщите пожалуйста ваш день рождения в формате дд.мм.гггг"

BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг"

ASK_EMAIL = "Укажите ваш E-mail в формате <b>example@domain.ru</b>. " \
            "E-mail необходим для рассылки новостей, важных изменений, наград за участие и т.д."
           
BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_CITI = "Введите название вашего города"

ASK_COMPANY = "Введите название вашей компании"

ASK_JOB = "Введите название вашей должности"

ASK_SITE = "Введите адрес сайта вашей компании"

FIN_MESS = "Поздравляем! Вы успешно зарегистрировались в системе URBANIUS. " \
           "Информация передана администраторам." \
           "Для использования полного набора функций Вам необходимо дождаться подтвержденя регистрации. " \
           "О подтверждении регистрации мы вам сообщим. А пока можете в профиле пользователя исправить введенные и заполнить дополнительные данные"
        