REGISTRATION_CANCELED = "Процедура регистраци отменена." 

ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  

USERNAME_NEEDED = "<b>Рекомендуется создать имя пользователя в настройках своего профиля Telegram.</b>"

REGISTRATION_START_MESSS = "Здравствуйте! Вы еще не зарегистрированы в системе URBANIUS CLUB. Пройдите регистрацию."                  
                           
WELCOME_REG = "Вас приветствует Urbanius Bot - "\
    "интерактивный помощник сообщества. Нажимая кнопку «Согласен», " \
    "Вы даете свое согласие на обработку ваших персональных данных. " \
    "Полная версия Политики конфиденциальности расположена в сети Интернет " \
        "по адресу https://urbanius.club/policy."
# WELCOME_REG = "Добрый день! Вы находитесь в Telegram боте URBANIUS CLUB. " \
#           "Для участия Вам необходимо пройти регистрацию. Ознакомьтесь, пожалуйста, с Политикой конфиденциальности. " \
#           "Нажимая кнопку «Согласен», Вы даете свое согласие на обработку ваших персональных данных. " \
#           "Это необходимо, чтобы мы могли с вами взаимодействовать. \n" \
#           "Политика конфиденциальности: https://urbanius.club/policy"


ASK_PHONE = "Предоставьте свой номер телефона, чтобы мы могли при необходимости с вами связаться. " \
            "Это может потребоваться в случае возникновения вопросов, отправки наград и прочим вопросам."        

ASK_FIO = "Ваше ФИО взяты из Телеграм '{}'. Можете ввести другие или пропустить этот шаг."

ASK_ABOUT = "Напишите подробно о своей деятельности: в каких компаниях работаете/работали или основали? " \
            "Над какими проектами сейчас работаете? Ваши достижения."

ASK_BIRHDAY = "Сообщите Ваш день рождения в формате дд.мм.гггг."

BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг"

ASK_EMAIL = "Укажите ваш E-mail в формате <b>example@domain.ru</b>. " \
            "E-mail необходим для рассылки новостей, важных изменений, наград за участие и т.д."
           
BAD_EMAIL = "E-mail введен неверно. Пожалуйста повторите ввод"

ASK_CITI = "Введите название вашего города"

ASK_COMPANY = "Введите название вашей компании"

ASK_JOB = "Введите название вашей должности"

ASK_SITE = "Введите адрес сайта вашей компании"

FINISH = "Закончена работа с новым пользователем"
        