
REQWEST_EXIST = "У вас уже оформлена заявка на это предложение. Вы можете найти ее в меню 'Мои заявки'"
ASK_REENTER = "Пожалуйста, используйте доступные пункты меню."  
REQW_FINISH = "Завершена работа с заявками"
SO_FINISH = "Завершена работа со специальными предложениями"
HELLO_MESS = "Вы в меню работы с вашими заявками"
HELLO_SO_MESS = "Вы в меню работы со специальными предложениями"

ASK_SO_NAME = "Введите название специального предложения"
ASK_SO_TEXT = "Введите текст специального предложения"
ASK_SO_VALID_DATE = "Введите дату действия специального предложения"
BAD_DATE = "Дата введена неверно. Повторите ввод в формате дд.мм.гггг"
ASK_SO_IMAGE = "Введите картинку для специального предложения"
SO_SAVED = "Специальное предложение введено. Оно будет доступно после утверждения"